app/views/users/show.html.erb

SELECT COUNT(*) FROM "microposts" WHERE ("microposts".user_id = 3)
---
        <%= render 'follow_form' if signed_in? %>
        <% unless @user.microposts.empty? %>