app/controllers/microposts_controller.rb

  def create

   @micropost  = current_user.microposts.build(params[:micropost])
    if @micropost.save
---
INSERT INTO "microposts" ("user_id", "content", "updated_at", "created_at") VALUES (1, 'Lorem ipsum dolor sit amet', '2011-01-03 21:09:03.383428', '2011-01-03 21:09:03.383428')

  def destroy
  @micropost.destroy
---
DELETE FROM "microposts" WHERE ("microposts"."id" = 303)