app/controllers/users_controller.rb

def show

 @user = User.find(params[:id])
 @microposts = @user.microposts.paginate(:page => params[:page])
---
SELECT "users".* FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1
SELECT "microposts".* FROM "microposts" WHERE ("microposts".user_id = 1) ORDER BY microposts.created_at DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "microposts" WHERE ("microposts".user_id = 100)

def create
 @user = User.new(params[:user])
 if @user.save
---
INSERT INTO "users" ("name", "encrypted_password", "email", "created_at", "admin", "salt", "updated_at") VALUES ('Rails Tutorials', '234a1dbdb694bedf3d5d0532712bf6f003e222616646e72be28aee2b76d616e7', 'example@railstutorial.org', '2010-12-30 21:38:10.209751', NULL, 'aca7d2e02cc81a2af9e8bda521017818eb48435307805041e3940a31eb106a13', '2010-12-30 21:38:10.209751')

def edit

@user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1

 def following
    @title = "Following"
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1

  def followers
    @title = "Followers"
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE ("users"."id" = 105) LIMIT 1